In [2]:
import numpy as np

In [3]:
import pandas as pd

In [3]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [4]:
arr

array([10, 20, 30])

In [11]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [19]:
ser1=pd.Series(my_data,index=["India","USA","China"])

In [20]:
ser1

India    10
USA      20
China    30
dtype: int64

In [21]:
ser2=pd.Series(my_data,index=["India","USA","UK"])

In [22]:
ser2

India    10
USA      20
UK       30
dtype: int64

In [23]:
ser1+ser2

China     NaN
India    20.0
UK        NaN
USA      40.0
dtype: float64

In [9]:
from numpy.random import randn

In [10]:
np.random.seed(101)

In [19]:
df= pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [12]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [36]:
type(df['W'])

pandas.core.series.Series

In [37]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [39]:
df['new']=df['X']+df['Y']

In [40]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [41]:
df.drop('new',axis=1,inplace=True)

In [42]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df.drop('Z',axis=1)

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [45]:
df#Created df again

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [49]:
df.loc["A"]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [50]:
df.iloc[0]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [51]:
df.loc["C",'Z']

0.32964629880452445

In [52]:
df.loc[['C','D'],['X','Z']]

         X         Z
C  0.07296  0.329646
D -0.75407  0.484752

In [55]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [56]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [57]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [58]:
df["W"]

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [59]:
df["W"]>0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [60]:
df[df["W"]>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [61]:
resultdf = df[df["W"]>0]

In [62]:
resultdf

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [63]:
resultdf["Y"]

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [64]:
df[df["W"]>0]["Y"]

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [66]:
df[df["W"]>0][['W','X','Y']]

          W         X         Y
A  0.302665  1.693723 -1.706086
C  0.807706  0.072960  0.638787

In [70]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [71]:
df[(df['W']<0) and (df['Y']>0)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [69]:
df[(df['W']<0) & (df['Y']>0)]

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
E -0.116773  1.901755  0.238127  1.996652

In [14]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [16]:
df.reset_index(inplace=True)

In [17]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [21]:
newIndex="MH MP RJ UP".split()

In [25]:
newIndex.append("JK")

In [28]:
newIndex.pop()

'JK'

In [29]:
newIndex

['MH', 'MP', 'RJ', 'UP', 'JK']

In [30]:
df["States"]=newIndex #To add column to the Data Frame with columnname 'States'

In [31]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     MH
B -0.134841  0.390528  0.166905  0.184502     MP
C  0.807706  0.072960  0.638787  0.329646     RJ
D -0.497104 -0.754070 -0.943406  0.484752     UP
E -0.116773  1.901755  0.238127  1.996652     JK

In [32]:
df.set_index('States')

               W         X         Y         Z
States
MH      0.302665  1.693723 -1.706086 -1.159119
MP     -0.134841  0.390528  0.166905  0.184502
RJ      0.807706  0.072960  0.638787  0.329646
UP     -0.497104 -0.754070 -0.943406  0.484752
JK     -0.116773  1.901755  0.238127  1.996652

In [33]:
df # As for above command inplace=True is required

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     MH
B -0.134841  0.390528  0.166905  0.184502     MP
C  0.807706  0.072960  0.638787  0.329646     RJ
D -0.497104 -0.754070 -0.943406  0.484752     UP
E -0.116773  1.901755  0.238127  1.996652     JK

In [38]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [39]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [42]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [43]:
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [44]:
df.loc['G1']

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [46]:
df.iloc[3]

A   -0.031579
B    0.649826
Name: (G2, 1), dtype: float64

In [47]:
df.index.names=["Groups","Num"]

In [48]:
df

                   A         B
Groups Num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419

In [52]:
df.loc['G2'].loc[2]['B']

-0.6102588558227414

In [53]:
df.loc['G1'].loc[3]['A']

1.025984152081572

In [57]:
df

                   A         B
Groups Num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419

In [59]:
df.xs('G1')

            A         B
Num
1   -0.993263  0.196800
2   -1.136645  0.000366
3    1.025984 -0.156598

In [55]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.993263  0.196800
G2     -0.031579  0.649826

# Missing Data

In [65]:
d={'A':[1,np.nan,2],'B':[np.nan,np.nan,6],'C':[7,8,9]}

In [66]:
df=pd.DataFrame(d)

In [67]:
df

     A    B  C
0  1.0  NaN  7
1  NaN  NaN  8
2  2.0  6.0  9

In [68]:
df.dropna()

     A    B  C
2  2.0  6.0  9

In [69]:
df.dropna(axis=1)

   C
0  7
1  8
2  9

In [70]:
df

     A    B  C
0  1.0  NaN  7
1  NaN  NaN  8
2  2.0  6.0  9

In [71]:
df.dropna(thresh=2)

     A    B  C
0  1.0  NaN  7
2  2.0  6.0  9

In [72]:
df.fillna(value="New")

     A    B  C
0    1  New  7
1  New  New  8
2    2    6  9

In [77]:
df.loc[1].fillna(value=df['A'].mean())

A    1.5
B    1.5
C    8.0
Name: 1, dtype: float64

In [1]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [4]:
df=pd.DataFrame(data)

In [5]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [6]:
df.groupby('Company')

In [7]:
byCompany=df.groupby('Company')

In [8]:
byCompany

In [9]:
byCompany.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [10]:
byCompany.mean().loc['GOOG']

Sales    160.0
Name: GOOG, dtype: float64

In [11]:
df.groupby('Company').mean().loc['FB']

Sales    296.5
Name: FB, dtype: float64

In [12]:
df.groupby('Company').count() #max(), min() some other aggregate functions

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [13]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [14]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [15]:
df.groupby('Company').describe().transpose()['MSFT']

Sales  count      2.000000
       mean     232.000000
       std      152.735065
       min      124.000000
       25%      178.000000
       50%      232.000000
       75%      286.000000
       max      340.000000
Name: MSFT, dtype: float64

In [21]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
             'B':['B0','B1','B2','B3'],
             'key':['K0','K1','K2','K3'],
             },index=[0,1,2,3])

In [22]:
df1

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [25]:
df2=pd.DataFrame({'C':['C0','C1','C2','C3'],
             'D':['D0','D1','D2','D3'],
             'key':['K0','K1','K2','K4'],
             },index=[0,1,2,3])

In [27]:
pd.merge(df1,df2,how="outer",on="key")

     A    B key    C    D
0   A0   B0  K0   C0   D0
1   A1   B1  K1   C1   D1
2   A2   B2  K2   C2   D2
3   A3   B3  K3  NaN  NaN
4  NaN  NaN  K4   C3   D3

In [29]:
import numpy as np
import pandas as pd

In [30]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

In [31]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [32]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [33]:
df['col2'].nunique()

3

In [34]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [35]:
df[df['col1']>1]

   col1  col2 col3
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [36]:
def square(n):
    return n*n

In [37]:
df['col1'].apply(square) #Using your own customize function

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [38]:
df['col1'].apply(lambda x:x*x) #Using lambda Expression

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [39]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [40]:
df.rows

AttributeError: 'DataFrame' object has no attribute 'rows'

In [42]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

In [48]:
df=pd.DataFrame(data)

In [49]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [50]:
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [1]:
pwd

'C:\\Users\\DELL\\Udemy Python'

In [2]:
import pandas as pd

In [3]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
df=pd.read_csv('example')

In [5]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
df.to_csv('MyCSV')

In [10]:
pd.read_csv('MyCSV')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [13]:
df.to_csv('MyCSV',index=False)

In [14]:
pd.read_csv('MyCSV')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
df=pd.read_excel('C:/Users/DELL/Py-DS-ML-Bootcamp-master/Refactored_Py_DS_ML_Bootcamp-master/03-Python-for-Data-Analysis-Pandas/Excel_Sample.xlsx',sheetname='Sheet1')

In [5]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
df.to_excel('Example_excel.xlsx',sheet_name='NewSheet')

ModuleNotFoundError: No module named 'openpyxl'

In [9]:
data = pd.read_html('https://www.learnpython.org/en/Dictionaries')

ValueError: No tables found